
  <details>
  <summary>Click to expand</summary>

  ```terraform
  module.lambda.data.archive_file.token_refresh: Reading...
module.lambda.data.archive_file.token_refresh: Read complete after 0s [id=0a5ee18200d6ef0f79a444d2e6b317a84ea4c7ca]
module.compute.aws_key_pair.main: Refreshing state... [id=kubestock-key]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Reading...
data.aws_region.current: Reading...
module.kubernetes.aws_iam_role.k8s_nodes: Refreshing state... [id=kubestock-node-role]
module.compute.data.aws_ami.ubuntu: Reading...
module.lambda.aws_iam_role.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role]
module.ecr.aws_ecr_repository.microservices["ms-order-management"]: Refreshing state... [id=ms-order-management]
module.ecr.aws_ecr_repository.microservices["ms-inventory"]: Refreshing state... [id=ms-inventory]
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.lambda.aws_cloudwatch_event_rule.token_refresh_schedule: Refreshing state... [id=kubestock-token-refresh-schedule]
data.aws_caller_identity.current: Reading...
module.ecr.aws_ecr_repository.microservices["ms-supplier"]: Refreshing state... [id=ms-supplier]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Read complete after 1s [id=arn:aws:iam::478468757808:oidc-provider/token.actions.githubusercontent.com]
module.ecr.aws_ecr_repository.microservices["ms-product"]: Refreshing state... [id=ms-product]
data.aws_caller_identity.current: Read complete after 1s [id=478468757808]
module.ecr.aws_ecr_repository.microservices["ms-test"]: Refreshing state... [id=ms-test]
module.ecr.aws_ecr_repository.microservices["ms-identity"]: Refreshing state... [id=ms-identity]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0a65a6bd6be2223dc]
module.kubernetes.aws_iam_policy.k8s_controllers: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-controllers-policy]
module.cicd.aws_iam_role.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role]
module.lambda.aws_lambda_function.token_refresh: Refreshing state... [id=kubestock-refresh-join-token]
module.kubernetes.aws_iam_instance_profile.k8s_nodes: Refreshing state... [id=kubestock-node-profile]
module.kubernetes.aws_iam_role_policy_attachment.k8s_nodes_ssm: Refreshing state... [id=kubestock-node-role-20251122171458069900000001]
module.kubernetes.aws_iam_role_policy_attachment.k8s_controllers: Refreshing state... [id=kubestock-node-role-20251122171458070500000002]
module.lambda.aws_iam_policy.token_refresh: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-token-refresh-lambda-policy]
module.compute.data.aws_ami.ubuntu: Read complete after 2s [id=ami-0ade68f094cc81635]
module.kubernetes.aws_iam_role_policy.k8s_nodes_ssm_params: Refreshing state... [id=kubestock-node-role:k8s-nodes-ssm-policy]
module.ecr.aws_ecr_lifecycle_policy.microservices["ms-product"]: Refreshing state... [id=ms-product]
module.ecr.aws_ecr_lifecycle_policy.microservices["ms-order-management"]: Refreshing state... [id=ms-order-management]
module.ecr.aws_ecr_lifecycle_policy.microservices["ms-identity"]: Refreshing state... [id=ms-identity]
module.ecr.aws_ecr_lifecycle_policy.microservices["ms-supplier"]: Refreshing state... [id=ms-supplier]
module.ecr.aws_ecr_lifecycle_policy.microservices["ms-test"]: Refreshing state... [id=ms-test]
module.ecr.aws_ecr_lifecycle_policy.microservices["ms-inventory"]: Refreshing state... [id=ms-inventory]
module.cicd.aws_iam_policy.github_actions_ecr: Refreshing state... [id=arn:aws:iam::478468757808:policy/KubeStock-github-actions-ecr-policy]
module.lambda.aws_iam_role_policy_attachment.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role-20251130171832420000000001]
module.cicd.aws_iam_role_policy_attachment.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role-20251125155745016000000001]
module.lambda.aws_cloudwatch_event_target.token_refresh: Refreshing state... [id=kubestock-token-refresh-schedule-RefreshKubeToken]
module.lambda.aws_cloudwatch_log_group.token_refresh: Refreshing state... [id=/aws/lambda/kubestock-refresh-join-token]
module.lambda.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowEventBridgeInvoke]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-01f445518c285bb47]
module.networking.aws_subnet.private[2]: Refreshing state... [id=subnet-0780d8e640722a270]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0b1dc7ca3ea5b0331]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0559dfc1c9f2ba26d]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-01240ef2e0b751289]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0537648f14b08fae9]
module.networking.aws_subnet.public[2]: Refreshing state... [id=subnet-0577be992dc0ab111]
module.kubernetes.aws_lb_target_group.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-0b8af5ccdc9c1d59a]
module.security.aws_security_group.k8s_common: Refreshing state... [id=sg-0b067e3fb603b11be]
module.security.aws_security_group.dev_server: Refreshing state... [id=sg-0d67ff044a38749c1]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-0343d1d2c3192b117]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-05c13f4e14ae0919a]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0382b6c798e2559df]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-032368bbbbdbffa70]
module.networking.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-072cb499e6ec152fc]
module.compute.aws_instance.bastion: Refreshing state... [id=i-00f0ca79b9ce4c42b]
module.security.aws_security_group.workers: Refreshing state... [id=sg-08b85cb7308f90c2f]
module.security.aws_security_group.nlb_api: Refreshing state... [id=sg-0b0d4dba43b6333e3]
module.compute.aws_instance.dev_server: Refreshing state... [id=i-08c6d4bdb5a49427a]
module.kubernetes.aws_launch_template.k8s_worker: Refreshing state... [id=lt-01159ecec1ce86876]
module.security.aws_security_group.control_plane: Refreshing state... [id=sg-0ac3836e0f42135fb]
module.kubernetes.aws_lb.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb-api/9f36c11b9d916d59]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-054ea26583c09fb63]
module.networking.aws_route_table.private[2]: Refreshing state... [id=rtb-04b01b74ef23587e6]
module.networking.aws_route_table.private[0]: Refreshing state... [id=rtb-06f165d277305b4f2]
module.networking.aws_route_table.private[1]: Refreshing state... [id=rtb-0b5da2e36e8f81b57]
module.kubernetes.aws_instance.control_plane: Refreshing state... [id=i-08ff658102a4848d6]
module.kubernetes.aws_autoscaling_group.k8s_workers: Refreshing state... [id=kubestock-workers-asg]
module.networking.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0861217d4449ff33d]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05cd7e585640a44e2]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0899b49bc97142ad1]
module.kubernetes.aws_lb_listener.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb-api/9f36c11b9d916d59/7ba42e9873ca8f56]
module.compute.aws_eip.bastion: Refreshing state... [id=eipalloc-0e7b598a9492e3186]
module.kubernetes.aws_lb_target_group_attachment.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b-2025112217153294790000000a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cicd.aws_iam_policy.github_actions_ecr will be updated in-place
  ~ resource "aws_iam_policy" "github_actions_ecr" {
        id               = "arn:aws:iam::478468757808:policy/KubeStock-github-actions-ecr-policy"
        name             = "KubeStock-github-actions-ecr-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetAuthorizationToken",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ECRGetAuthorizationToken"
                    },
                  - {
                      - Action   = [
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:DescribeRepositories",
                          - "ecr:ListImages",
                          - "ecr:DescribeImages",
                          - "ecr:BatchGetImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:PutImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecr:ap-south-1:478468757808:repository/ms-identity",
                          - "arn:aws:ecr:ap-south-1:478468757808:repository/ms-inventory",
                          - "arn:aws:ecr:ap-south-1:478468757808:repository/ms-order-management",
                          - "arn:aws:ecr:ap-south-1:478468757808:repository/ms-product",
                          - "arn:aws:ecr:ap-south-1:478468757808:repository/ms-supplier",
                          - "arn:aws:ecr:ap-south-1:478468757808:repository/ms-test",
                        ]
                      - Sid      = "ECRPushImage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "ManagedBy" = "Terraform"
            "Name"      = "KubeStock-github-actions-ecr-policy"
            "Purpose"   = "GitHub Actions ECR Access"
        }
        # (7 unchanged attributes hidden)
    }

  # module.cicd.aws_iam_role.github_actions_ecr will be updated in-place
  ~ resource "aws_iam_role" "github_actions_ecr" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = [
                                    # (5 unchanged elements hidden)
                                    "repo:KubeStock-DevOps-project/ms-identity:environment:production",
                                  + "repo:KubeStock-DevOps-project/kubestock-frontend:environment:production",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "KubeStock-github-actions-ecr-role"
        name                  = "KubeStock-github-actions-ecr-role"
        tags                  = {
            "ManagedBy" = "Terraform"
            "Name"      = "KubeStock-github-actions-ecr-role"
            "Purpose"   = "GitHub Actions ECR Access"
        }
        # (11 unchanged attributes hidden)
    }

  # module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock-frontend"] will be created
  + resource "aws_ecr_lifecycle_policy" "microservices" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "kubestock-frontend"
    }

  # module.ecr.aws_ecr_repository.microservices["kubestock-frontend"] will be created
  + resource "aws_ecr_repository" "microservices" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "kubestock-frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-frontend"
          + "Project"     = "KubeStock"
          + "Service"     = "kubestock-frontend"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-frontend"
          + "Project"     = "KubeStock"
          + "Service"     = "kubestock-frontend"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ ecr_repository_arns            = {
      + kubestock-frontend  = (known after apply)
        # (6 unchanged attributes hidden)
    }
  ~ ecr_repository_urls            = {
      + kubestock-frontend  = (known after apply)
        # (6 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
        